<keras.engine.training.Model object at 0x2b71c5867320>
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 299, 299, 3)   0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 149, 149, 32)  896         input_1[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 149, 149, 32)  128         convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 147, 147, 32)  9248        batchnormalization_1[0][0]       
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 147, 147, 32)  128         convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 147, 147, 64)  18496       batchnormalization_2[0][0]       
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 147, 147, 64)  256         convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 73, 73, 64)    0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 73, 73, 80)    5200        maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 73, 73, 80)    320         convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 71, 71, 192)   138432      batchnormalization_4[0][0]       
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 71, 71, 192)   768         convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 35, 35, 192)   0           batchnormalization_5[0][0]       
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 35, 35, 64)    12352       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
batchnormalization_9 (BatchNorma (None, 35, 35, 64)    256         convolution2d_9[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 35, 35, 48)    9264        maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 35, 35, 96)    55392       batchnormalization_9[0][0]       
____________________________________________________________________________________________________
batchnormalization_7 (BatchNorma (None, 35, 35, 48)    192         convolution2d_7[0][0]            
____________________________________________________________________________________________________
batchnormalization_10 (BatchNorm (None, 35, 35, 96)    384         convolution2d_10[0][0]           
____________________________________________________________________________________________________
averagepooling2d_1 (AveragePooli (None, 35, 35, 192)   0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 35, 35, 64)    12352       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 35, 35, 64)    76864       batchnormalization_7[0][0]       
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 35, 35, 96)    83040       batchnormalization_10[0][0]      
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 35, 35, 32)    6176        averagepooling2d_1[0][0]         
____________________________________________________________________________________________________
batchnormalization_6 (BatchNorma (None, 35, 35, 64)    256         convolution2d_6[0][0]            
____________________________________________________________________________________________________
batchnormalization_8 (BatchNorma (None, 35, 35, 64)    256         convolution2d_8[0][0]            
____________________________________________________________________________________________________
batchnormalization_11 (BatchNorm (None, 35, 35, 96)    384         convolution2d_11[0][0]           
____________________________________________________________________________________________________
batchnormalization_12 (BatchNorm (None, 35, 35, 32)    128         convolution2d_12[0][0]           
____________________________________________________________________________________________________
mixed0 (Merge)                   (None, 35, 35, 256)   0           batchnormalization_6[0][0]       
                                                                   batchnormalization_8[0][0]       
                                                                   batchnormalization_11[0][0]      
                                                                   batchnormalization_12[0][0]      
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, 35, 35, 64)    16448       mixed0[0][0]                     
____________________________________________________________________________________________________
batchnormalization_16 (BatchNorm (None, 35, 35, 64)    256         convolution2d_16[0][0]           
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 35, 35, 48)    12336       mixed0[0][0]                     
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, 35, 35, 96)    55392       batchnormalization_16[0][0]      
____________________________________________________________________________________________________
batchnormalization_14 (BatchNorm (None, 35, 35, 48)    192         convolution2d_14[0][0]           
____________________________________________________________________________________________________
batchnormalization_17 (BatchNorm (None, 35, 35, 96)    384         convolution2d_17[0][0]           
____________________________________________________________________________________________________
averagepooling2d_2 (AveragePooli (None, 35, 35, 256)   0           mixed0[0][0]                     
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 35, 35, 64)    16448       mixed0[0][0]                     
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 35, 35, 64)    76864       batchnormalization_14[0][0]      
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, 35, 35, 96)    83040       batchnormalization_17[0][0]      
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D) (None, 35, 35, 32)    8224        averagepooling2d_2[0][0]         
____________________________________________________________________________________________________
batchnormalization_13 (BatchNorm (None, 35, 35, 64)    256         convolution2d_13[0][0]           
____________________________________________________________________________________________________
batchnormalization_15 (BatchNorm (None, 35, 35, 64)    256         convolution2d_15[0][0]           
____________________________________________________________________________________________________
batchnormalization_18 (BatchNorm (None, 35, 35, 96)    384         convolution2d_18[0][0]           
____________________________________________________________________________________________________
batchnormalization_19 (BatchNorm (None, 35, 35, 32)    128         convolution2d_19[0][0]           
____________________________________________________________________________________________________
mixed1 (Merge)                   (None, 35, 35, 256)   0           batchnormalization_13[0][0]      
                                                                   batchnormalization_15[0][0]      
                                                                   batchnormalization_18[0][0]      
                                                                   batchnormalization_19[0][0]      
____________________________________________________________________________________________________
convolution2d_23 (Convolution2D) (None, 35, 35, 64)    16448       mixed1[0][0]                     
____________________________________________________________________________________________________
batchnormalization_23 (BatchNorm (None, 35, 35, 64)    256         convolution2d_23[0][0]           
____________________________________________________________________________________________________
convolution2d_21 (Convolution2D) (None, 35, 35, 48)    12336       mixed1[0][0]                     
____________________________________________________________________________________________________
convolution2d_24 (Convolution2D) (None, 35, 35, 96)    55392       batchnormalization_23[0][0]      
____________________________________________________________________________________________________
batchnormalization_21 (BatchNorm (None, 35, 35, 48)    192         convolution2d_21[0][0]           
____________________________________________________________________________________________________
batchnormalization_24 (BatchNorm (None, 35, 35, 96)    384         convolution2d_24[0][0]           
____________________________________________________________________________________________________
averagepooling2d_3 (AveragePooli (None, 35, 35, 256)   0           mixed1[0][0]                     
____________________________________________________________________________________________________
convolution2d_20 (Convolution2D) (None, 35, 35, 64)    16448       mixed1[0][0]                     
____________________________________________________________________________________________________
convolution2d_22 (Convolution2D) (None, 35, 35, 64)    76864       batchnormalization_21[0][0]      
____________________________________________________________________________________________________
convolution2d_25 (Convolution2D) (None, 35, 35, 96)    83040       batchnormalization_24[0][0]      
____________________________________________________________________________________________________
convolution2d_26 (Convolution2D) (None, 35, 35, 32)    8224        averagepooling2d_3[0][0]         
____________________________________________________________________________________________________
batchnormalization_20 (BatchNorm (None, 35, 35, 64)    256         convolution2d_20[0][0]           
____________________________________________________________________________________________________
batchnormalization_22 (BatchNorm (None, 35, 35, 64)    256         convolution2d_22[0][0]           
____________________________________________________________________________________________________
batchnormalization_25 (BatchNorm (None, 35, 35, 96)    384         convolution2d_25[0][0]           
____________________________________________________________________________________________________
batchnormalization_26 (BatchNorm (None, 35, 35, 32)    128         convolution2d_26[0][0]           
____________________________________________________________________________________________________
mixed2 (Merge)                   (None, 35, 35, 256)   0           batchnormalization_20[0][0]      
                                                                   batchnormalization_22[0][0]      
                                                                   batchnormalization_25[0][0]      
                                                                   batchnormalization_26[0][0]      
____________________________________________________________________________________________________
convolution2d_28 (Convolution2D) (None, 35, 35, 64)    16448       mixed2[0][0]                     
____________________________________________________________________________________________________
batchnormalization_28 (BatchNorm (None, 35, 35, 64)    256         convolution2d_28[0][0]           
____________________________________________________________________________________________________
convolution2d_29 (Convolution2D) (None, 35, 35, 96)    55392       batchnormalization_28[0][0]      
____________________________________________________________________________________________________
batchnormalization_29 (BatchNorm (None, 35, 35, 96)    384         convolution2d_29[0][0]           
____________________________________________________________________________________________________
convolution2d_27 (Convolution2D) (None, 17, 17, 384)   885120      mixed2[0][0]                     
____________________________________________________________________________________________________
convolution2d_30 (Convolution2D) (None, 17, 17, 96)    83040       batchnormalization_29[0][0]      
____________________________________________________________________________________________________
batchnormalization_27 (BatchNorm (None, 17, 17, 384)   1536        convolution2d_27[0][0]           
____________________________________________________________________________________________________
batchnormalization_30 (BatchNorm (None, 17, 17, 96)    384         convolution2d_30[0][0]           
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 17, 17, 256)   0           mixed2[0][0]                     
____________________________________________________________________________________________________
mixed3 (Merge)                   (None, 17, 17, 736)   0           batchnormalization_27[0][0]      
                                                                   batchnormalization_30[0][0]      
                                                                   maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_35 (Convolution2D) (None, 17, 17, 128)   94336       mixed3[0][0]                     
____________________________________________________________________________________________________
batchnormalization_35 (BatchNorm (None, 17, 17, 128)   512         convolution2d_35[0][0]           
____________________________________________________________________________________________________
convolution2d_36 (Convolution2D) (None, 17, 17, 128)   114816      batchnormalization_35[0][0]      
____________________________________________________________________________________________________
batchnormalization_36 (BatchNorm (None, 17, 17, 128)   512         convolution2d_36[0][0]           
____________________________________________________________________________________________________
convolution2d_32 (Convolution2D) (None, 17, 17, 128)   94336       mixed3[0][0]                     
____________________________________________________________________________________________________
convolution2d_37 (Convolution2D) (None, 17, 17, 128)   114816      batchnormalization_36[0][0]      
____________________________________________________________________________________________________
batchnormalization_32 (BatchNorm (None, 17, 17, 128)   512         convolution2d_32[0][0]           
____________________________________________________________________________________________________
batchnormalization_37 (BatchNorm (None, 17, 17, 128)   512         convolution2d_37[0][0]           
____________________________________________________________________________________________________
convolution2d_33 (Convolution2D) (None, 17, 17, 128)   114816      batchnormalization_32[0][0]      
____________________________________________________________________________________________________
convolution2d_38 (Convolution2D) (None, 17, 17, 128)   114816      batchnormalization_37[0][0]      
____________________________________________________________________________________________________
batchnormalization_33 (BatchNorm (None, 17, 17, 128)   512         convolution2d_33[0][0]           
____________________________________________________________________________________________________
batchnormalization_38 (BatchNorm (None, 17, 17, 128)   512         convolution2d_38[0][0]           
____________________________________________________________________________________________________
averagepooling2d_4 (AveragePooli (None, 17, 17, 736)   0           mixed3[0][0]                     
____________________________________________________________________________________________________
convolution2d_31 (Convolution2D) (None, 17, 17, 192)   141504      mixed3[0][0]                     
____________________________________________________________________________________________________
convolution2d_34 (Convolution2D) (None, 17, 17, 192)   172224      batchnormalization_33[0][0]      
____________________________________________________________________________________________________
convolution2d_39 (Convolution2D) (None, 17, 17, 192)   172224      batchnormalization_38[0][0]      
____________________________________________________________________________________________________
convolution2d_40 (Convolution2D) (None, 17, 17, 192)   141504      averagepooling2d_4[0][0]         
____________________________________________________________________________________________________
batchnormalization_31 (BatchNorm (None, 17, 17, 192)   768         convolution2d_31[0][0]           
____________________________________________________________________________________________________
batchnormalization_34 (BatchNorm (None, 17, 17, 192)   768         convolution2d_34[0][0]           
____________________________________________________________________________________________________
batchnormalization_39 (BatchNorm (None, 17, 17, 192)   768         convolution2d_39[0][0]           
____________________________________________________________________________________________________
batchnormalization_40 (BatchNorm (None, 17, 17, 192)   768         convolution2d_40[0][0]           
____________________________________________________________________________________________________
mixed4 (Merge)                   (None, 17, 17, 768)   0           batchnormalization_31[0][0]      
                                                                   batchnormalization_34[0][0]      
                                                                   batchnormalization_39[0][0]      
                                                                   batchnormalization_40[0][0]      
____________________________________________________________________________________________________
convolution2d_45 (Convolution2D) (None, 17, 17, 160)   123040      mixed4[0][0]                     
____________________________________________________________________________________________________
batchnormalization_45 (BatchNorm (None, 17, 17, 160)   640         convolution2d_45[0][0]           
____________________________________________________________________________________________________
convolution2d_46 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_45[0][0]      
____________________________________________________________________________________________________
batchnormalization_46 (BatchNorm (None, 17, 17, 160)   640         convolution2d_46[0][0]           
____________________________________________________________________________________________________
convolution2d_42 (Convolution2D) (None, 17, 17, 160)   123040      mixed4[0][0]                     
____________________________________________________________________________________________________
convolution2d_47 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_46[0][0]      
____________________________________________________________________________________________________
batchnormalization_42 (BatchNorm (None, 17, 17, 160)   640         convolution2d_42[0][0]           
____________________________________________________________________________________________________
batchnormalization_47 (BatchNorm (None, 17, 17, 160)   640         convolution2d_47[0][0]           
____________________________________________________________________________________________________
convolution2d_43 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_42[0][0]      
____________________________________________________________________________________________________
convolution2d_48 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_47[0][0]      
____________________________________________________________________________________________________
batchnormalization_43 (BatchNorm (None, 17, 17, 160)   640         convolution2d_43[0][0]           
____________________________________________________________________________________________________
batchnormalization_48 (BatchNorm (None, 17, 17, 160)   640         convolution2d_48[0][0]           
____________________________________________________________________________________________________
averagepooling2d_5 (AveragePooli (None, 17, 17, 768)   0           mixed4[0][0]                     
____________________________________________________________________________________________________
convolution2d_41 (Convolution2D) (None, 17, 17, 192)   147648      mixed4[0][0]                     
____________________________________________________________________________________________________
convolution2d_44 (Convolution2D) (None, 17, 17, 192)   215232      batchnormalization_43[0][0]      
____________________________________________________________________________________________________
convolution2d_49 (Convolution2D) (None, 17, 17, 192)   215232      batchnormalization_48[0][0]      
____________________________________________________________________________________________________
convolution2d_50 (Convolution2D) (None, 17, 17, 192)   147648      averagepooling2d_5[0][0]         
____________________________________________________________________________________________________
batchnormalization_41 (BatchNorm (None, 17, 17, 192)   768         convolution2d_41[0][0]           
____________________________________________________________________________________________________
batchnormalization_44 (BatchNorm (None, 17, 17, 192)   768         convolution2d_44[0][0]           
____________________________________________________________________________________________________
batchnormalization_49 (BatchNorm (None, 17, 17, 192)   768         convolution2d_49[0][0]           
____________________________________________________________________________________________________
batchnormalization_50 (BatchNorm (None, 17, 17, 192)   768         convolution2d_50[0][0]           
____________________________________________________________________________________________________
mixed5 (Merge)                   (None, 17, 17, 768)   0           batchnormalization_41[0][0]      
                                                                   batchnormalization_44[0][0]      
                                                                   batchnormalization_49[0][0]      
                                                                   batchnormalization_50[0][0]      
____________________________________________________________________________________________________
convolution2d_55 (Convolution2D) (None, 17, 17, 160)   123040      mixed5[0][0]                     
____________________________________________________________________________________________________
batchnormalization_55 (BatchNorm (None, 17, 17, 160)   640         convolution2d_55[0][0]           
____________________________________________________________________________________________________
convolution2d_56 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_55[0][0]      
____________________________________________________________________________________________________
batchnormalization_56 (BatchNorm (None, 17, 17, 160)   640         convolution2d_56[0][0]           
____________________________________________________________________________________________________
convolution2d_52 (Convolution2D) (None, 17, 17, 160)   123040      mixed5[0][0]                     
____________________________________________________________________________________________________
convolution2d_57 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_56[0][0]      
____________________________________________________________________________________________________
batchnormalization_52 (BatchNorm (None, 17, 17, 160)   640         convolution2d_52[0][0]           
____________________________________________________________________________________________________
batchnormalization_57 (BatchNorm (None, 17, 17, 160)   640         convolution2d_57[0][0]           
____________________________________________________________________________________________________
convolution2d_53 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_52[0][0]      
____________________________________________________________________________________________________
convolution2d_58 (Convolution2D) (None, 17, 17, 160)   179360      batchnormalization_57[0][0]      
____________________________________________________________________________________________________
batchnormalization_53 (BatchNorm (None, 17, 17, 160)   640         convolution2d_53[0][0]           
____________________________________________________________________________________________________
batchnormalization_58 (BatchNorm (None, 17, 17, 160)   640         convolution2d_58[0][0]           
____________________________________________________________________________________________________
averagepooling2d_6 (AveragePooli (None, 17, 17, 768)   0           mixed5[0][0]                     
____________________________________________________________________________________________________
convolution2d_51 (Convolution2D) (None, 17, 17, 192)   147648      mixed5[0][0]                     
____________________________________________________________________________________________________
convolution2d_54 (Convolution2D) (None, 17, 17, 192)   215232      batchnormalization_53[0][0]      
____________________________________________________________________________________________________
convolution2d_59 (Convolution2D) (None, 17, 17, 192)   215232      batchnormalization_58[0][0]      
____________________________________________________________________________________________________
convolution2d_60 (Convolution2D) (None, 17, 17, 192)   147648      averagepooling2d_6[0][0]         
____________________________________________________________________________________________________
batchnormalization_51 (BatchNorm (None, 17, 17, 192)   768         convolution2d_51[0][0]           
____________________________________________________________________________________________________
batchnormalization_54 (BatchNorm (None, 17, 17, 192)   768         convolution2d_54[0][0]           
____________________________________________________________________________________________________
batchnormalization_59 (BatchNorm (None, 17, 17, 192)   768         convolution2d_59[0][0]           
____________________________________________________________________________________________________
batchnormalization_60 (BatchNorm (None, 17, 17, 192)   768         convolution2d_60[0][0]           
____________________________________________________________________________________________________
mixed6 (Merge)                   (None, 17, 17, 768)   0           batchnormalization_51[0][0]      
                                                                   batchnormalization_54[0][0]      
                                                                   batchnormalization_59[0][0]      
                                                                   batchnormalization_60[0][0]      
____________________________________________________________________________________________________
convolution2d_65 (Convolution2D) (None, 17, 17, 160)   123040      mixed6[0][0]                     
____________________________________________________________________________________________________
batchnormalization_65 (BatchNorm (None, 17, 17, 160)   640         convolution2d_65[0][0]           
____________________________________________________________________________________________________
convolution2d_66 (Convolution2D) (None, 17, 17, 192)   215232      batchnormalization_65[0][0]      
____________________________________________________________________________________________________
batchnormalization_66 (BatchNorm (None, 17, 17, 192)   768         convolution2d_66[0][0]           
____________________________________________________________________________________________________
convolution2d_62 (Convolution2D) (None, 17, 17, 192)   147648      mixed6[0][0]                     
____________________________________________________________________________________________________
convolution2d_67 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_66[0][0]      
____________________________________________________________________________________________________
batchnormalization_62 (BatchNorm (None, 17, 17, 192)   768         convolution2d_62[0][0]           
____________________________________________________________________________________________________
batchnormalization_67 (BatchNorm (None, 17, 17, 192)   768         convolution2d_67[0][0]           
____________________________________________________________________________________________________
convolution2d_63 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_62[0][0]      
____________________________________________________________________________________________________
convolution2d_68 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_67[0][0]      
____________________________________________________________________________________________________
batchnormalization_63 (BatchNorm (None, 17, 17, 192)   768         convolution2d_63[0][0]           
____________________________________________________________________________________________________
batchnormalization_68 (BatchNorm (None, 17, 17, 192)   768         convolution2d_68[0][0]           
____________________________________________________________________________________________________
averagepooling2d_7 (AveragePooli (None, 17, 17, 768)   0           mixed6[0][0]                     
____________________________________________________________________________________________________
convolution2d_61 (Convolution2D) (None, 17, 17, 192)   147648      mixed6[0][0]                     
____________________________________________________________________________________________________
convolution2d_64 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_63[0][0]      
____________________________________________________________________________________________________
convolution2d_69 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_68[0][0]      
____________________________________________________________________________________________________
convolution2d_70 (Convolution2D) (None, 17, 17, 192)   147648      averagepooling2d_7[0][0]         
____________________________________________________________________________________________________
batchnormalization_61 (BatchNorm (None, 17, 17, 192)   768         convolution2d_61[0][0]           
____________________________________________________________________________________________________
batchnormalization_64 (BatchNorm (None, 17, 17, 192)   768         convolution2d_64[0][0]           
____________________________________________________________________________________________________
batchnormalization_69 (BatchNorm (None, 17, 17, 192)   768         convolution2d_69[0][0]           
____________________________________________________________________________________________________
batchnormalization_70 (BatchNorm (None, 17, 17, 192)   768         convolution2d_70[0][0]           
____________________________________________________________________________________________________
mixed7 (Merge)                   (None, 17, 17, 768)   0           batchnormalization_61[0][0]      
                                                                   batchnormalization_64[0][0]      
                                                                   batchnormalization_69[0][0]      
                                                                   batchnormalization_70[0][0]      
____________________________________________________________________________________________________
convolution2d_73 (Convolution2D) (None, 17, 17, 192)   147648      mixed7[0][0]                     
____________________________________________________________________________________________________
batchnormalization_73 (BatchNorm (None, 17, 17, 192)   768         convolution2d_73[0][0]           
____________________________________________________________________________________________________
convolution2d_74 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_73[0][0]      
____________________________________________________________________________________________________
batchnormalization_74 (BatchNorm (None, 17, 17, 192)   768         convolution2d_74[0][0]           
____________________________________________________________________________________________________
convolution2d_71 (Convolution2D) (None, 17, 17, 192)   147648      mixed7[0][0]                     
____________________________________________________________________________________________________
convolution2d_75 (Convolution2D) (None, 17, 17, 192)   258240      batchnormalization_74[0][0]      
____________________________________________________________________________________________________
batchnormalization_71 (BatchNorm (None, 17, 17, 192)   768         convolution2d_71[0][0]           
____________________________________________________________________________________________________
batchnormalization_75 (BatchNorm (None, 17, 17, 192)   768         convolution2d_75[0][0]           
____________________________________________________________________________________________________
convolution2d_72 (Convolution2D) (None, 8, 8, 320)     553280      batchnormalization_71[0][0]      
____________________________________________________________________________________________________
convolution2d_76 (Convolution2D) (None, 8, 8, 192)     331968      batchnormalization_75[0][0]      
____________________________________________________________________________________________________
batchnormalization_72 (BatchNorm (None, 8, 8, 320)     1280        convolution2d_72[0][0]           
____________________________________________________________________________________________________
batchnormalization_76 (BatchNorm (None, 8, 8, 192)     768         convolution2d_76[0][0]           
____________________________________________________________________________________________________
averagepooling2d_8 (AveragePooli (None, 8, 8, 768)     0           mixed7[0][0]                     
____________________________________________________________________________________________________
mixed8 (Merge)                   (None, 8, 8, 1280)    0           batchnormalization_72[0][0]      
                                                                   batchnormalization_76[0][0]      
                                                                   averagepooling2d_8[0][0]         
____________________________________________________________________________________________________
convolution2d_81 (Convolution2D) (None, 8, 8, 448)     573888      mixed8[0][0]                     
____________________________________________________________________________________________________
batchnormalization_81 (BatchNorm (None, 8, 8, 448)     1792        convolution2d_81[0][0]           
____________________________________________________________________________________________________
convolution2d_78 (Convolution2D) (None, 8, 8, 384)     491904      mixed8[0][0]                     
____________________________________________________________________________________________________
convolution2d_82 (Convolution2D) (None, 8, 8, 384)     1548672     batchnormalization_81[0][0]      
____________________________________________________________________________________________________
batchnormalization_78 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_78[0][0]           
____________________________________________________________________________________________________
batchnormalization_82 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_82[0][0]           
____________________________________________________________________________________________________
convolution2d_79 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_78[0][0]      
____________________________________________________________________________________________________
convolution2d_80 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_78[0][0]      
____________________________________________________________________________________________________
convolution2d_83 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_82[0][0]      
____________________________________________________________________________________________________
convolution2d_84 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_82[0][0]      
____________________________________________________________________________________________________
averagepooling2d_9 (AveragePooli (None, 8, 8, 1280)    0           mixed8[0][0]                     
____________________________________________________________________________________________________
convolution2d_77 (Convolution2D) (None, 8, 8, 320)     409920      mixed8[0][0]                     
____________________________________________________________________________________________________
batchnormalization_79 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_79[0][0]           
____________________________________________________________________________________________________
batchnormalization_80 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_80[0][0]           
____________________________________________________________________________________________________
batchnormalization_83 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_83[0][0]           
____________________________________________________________________________________________________
batchnormalization_84 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_84[0][0]           
____________________________________________________________________________________________________
convolution2d_85 (Convolution2D) (None, 8, 8, 192)     245952      averagepooling2d_9[0][0]         
____________________________________________________________________________________________________
batchnormalization_77 (BatchNorm (None, 8, 8, 320)     1280        convolution2d_77[0][0]           
____________________________________________________________________________________________________
mixed9_0 (Merge)                 (None, 8, 8, 768)     0           batchnormalization_79[0][0]      
                                                                   batchnormalization_80[0][0]      
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 8, 8, 768)     0           batchnormalization_83[0][0]      
                                                                   batchnormalization_84[0][0]      
____________________________________________________________________________________________________
batchnormalization_85 (BatchNorm (None, 8, 8, 192)     768         convolution2d_85[0][0]           
____________________________________________________________________________________________________
mixed9 (Merge)                   (None, 8, 8, 2048)    0           batchnormalization_77[0][0]      
                                                                   mixed9_0[0][0]                   
                                                                   merge_1[0][0]                    
                                                                   batchnormalization_85[0][0]      
____________________________________________________________________________________________________
convolution2d_90 (Convolution2D) (None, 8, 8, 448)     917952      mixed9[0][0]                     
____________________________________________________________________________________________________
batchnormalization_90 (BatchNorm (None, 8, 8, 448)     1792        convolution2d_90[0][0]           
____________________________________________________________________________________________________
convolution2d_87 (Convolution2D) (None, 8, 8, 384)     786816      mixed9[0][0]                     
____________________________________________________________________________________________________
convolution2d_91 (Convolution2D) (None, 8, 8, 384)     1548672     batchnormalization_90[0][0]      
____________________________________________________________________________________________________
batchnormalization_87 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_87[0][0]           
____________________________________________________________________________________________________
batchnormalization_91 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_91[0][0]           
____________________________________________________________________________________________________
convolution2d_88 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_87[0][0]      
____________________________________________________________________________________________________
convolution2d_89 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_87[0][0]      
____________________________________________________________________________________________________
convolution2d_92 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_91[0][0]      
____________________________________________________________________________________________________
convolution2d_93 (Convolution2D) (None, 8, 8, 384)     442752      batchnormalization_91[0][0]      
____________________________________________________________________________________________________
averagepooling2d_10 (AveragePool (None, 8, 8, 2048)    0           mixed9[0][0]                     
____________________________________________________________________________________________________
convolution2d_86 (Convolution2D) (None, 8, 8, 320)     655680      mixed9[0][0]                     
____________________________________________________________________________________________________
batchnormalization_88 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_88[0][0]           
____________________________________________________________________________________________________
batchnormalization_89 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_89[0][0]           
____________________________________________________________________________________________________
batchnormalization_92 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_92[0][0]           
____________________________________________________________________________________________________
batchnormalization_93 (BatchNorm (None, 8, 8, 384)     1536        convolution2d_93[0][0]           
____________________________________________________________________________________________________
convolution2d_94 (Convolution2D) (None, 8, 8, 192)     393408      averagepooling2d_10[0][0]        
____________________________________________________________________________________________________
batchnormalization_86 (BatchNorm (None, 8, 8, 320)     1280        convolution2d_86[0][0]           
____________________________________________________________________________________________________
mixed9_1 (Merge)                 (None, 8, 8, 768)     0           batchnormalization_88[0][0]      
                                                                   batchnormalization_89[0][0]      
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 8, 8, 768)     0           batchnormalization_92[0][0]      
                                                                   batchnormalization_93[0][0]      
____________________________________________________________________________________________________
batchnormalization_94 (BatchNorm (None, 8, 8, 192)     768         convolution2d_94[0][0]           
____________________________________________________________________________________________________
mixed10 (Merge)                  (None, 8, 8, 2048)    0           batchnormalization_86[0][0]      
                                                                   mixed9_1[0][0]                   
                                                                   merge_2[0][0]                    
                                                                   batchnormalization_94[0][0]      
____________________________________________________________________________________________________
avg_pool (AveragePooling2D)      (None, 1, 1, 2048)    0           mixed10[0][0]                    
____________________________________________________________________________________________________
flatten (Flatten)                (None, 2048)          0           avg_pool[0][0]                   
____________________________________________________________________________________________________
predictions (Dense)              (None, 1000)          2049000     flatten[0][0]                    
====================================================================================================
Total params: 23,660,968
Trainable params: 23,626,728
Non-trainable params: 34,240
____________________________________________________________________________________________________
