{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_regularizer": null, "b_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "W_constraint": null, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 32, "trainable": true, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 32, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "border_mode": "same", "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "bias": true, "W_constraint": null, "b_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "output_dim": 512, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "output_dim": 10, "W_regularizer": null, "activity_regularizer": null, "input_dim": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "keras_version": "1.1.1"}